{
  "backend/main.mo": "Motoko canister implementing the backend for an e-commerce furniture store with user profiles, products, orders, carts, wishlists, and product stats, including blob storage for media. It enforces role-based access control (admin/user), manages store info, and provides admin and user APIs.",
  "feature_evidence.json": "Structured report documenting implemented frontend features, primarily hash-based routing, navigation updates, access control messaging, and a not-found page. It links features to files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated high-level summaries of all major frontend files, describing routing, pages, components, hooks, styling, and design intent. Used as documentation or evidence rather than executable code.",
  "frontend/index.css": "Minimal CSS entry file that only includes Tailwind base, components, and utilities directives. Actual theme tokens are defined elsewhere to avoid duplication.",
  "frontend/index.html": "HTML entry point for the React application defining the root element and loading the main TypeScript module. Sets basic metadata like title and viewport.",
  "frontend/src/App.tsx": "Main React application component handling hash-based routing, global cart state, authentication, and admin access checks. It renders pages conditionally based on the current route and user permissions.",
  "frontend/src/components/Footer.tsx": "Footer component displaying store information, contact details, and a sitemap with role-based navigation links. Includes branding and attribution.",
  "frontend/src/components/Header.tsx": "Sticky header component with logo navigation, authentication controls, admin/user links, and a shopping cart drawer with quantity management. Integrates Internet Identity login and React Query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Always-open modal that prompts the user for their name and saves a new user profile via a React Query mutation, with validation and toast feedback.",
  "frontend/src/components/storefront/CategoryStrip.tsx": "Grid of selectable product categories (including an \"All\" option) with icons and visual selected state, notifying the parent when the selection changes.",
  "frontend/src/components/storefront/ProductCard.tsx": "Reusable storefront card displaying a product image, name, description, price, and optional offer badge, with actions to view, add to cart, or buy now.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useHashRoute.ts": "Hook that derives and tracks the current application route from window.location.hash, updating on hashchange events.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook managing Internet Identity authentication, exposing identity state, login/logout functions, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend data (user profiles, admin checks, products, orders), built on top of the actor hook with cache invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens, base styles, and typography smoothing.",
  "frontend/src/main.tsx": "Frontend entry point that renders the App wrapped with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AdminAccessBlockedPage.tsx": "Page shown when admin access is denied, prompting unauthenticated users to log in or allowing navigation back home, with distinct messaging for non-admin users.",
  "frontend/src/pages/AdminPanel.tsx": "Implements an admin dashboard with tabs to manage products and orders, including adding/editing products, uploading media, and updating order statuses via query hooks.",
  "frontend/src/pages/CheckoutPage.tsx": "Provides a checkout flow with delivery form, cart summary, and order creation logic, handling validation, authentication, and empty-cart states.",
  "frontend/src/pages/HomePage.tsx": "Renders the storefront home with hero section, store info, category filtering, and product listings, enabling add-to-cart and buy-now actions.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the logged-in user's past orders with status badges, delivery details, and loading/authentication states.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a 404-style page not found message with a button to navigate back to the home page.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information with image/video gallery, quantity selection, add-to-cart/buy-now actions, and view count tracking.",
  "frontend/src/utils/hashRoutes.ts": "Defines hash-based routing utilities to parse, build, and navigate between app routes like home, admin, product details, checkout, and orders.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routing, persist them in sessionStorage, and retrieve or clear them with URL taking precedence. Includes helpers for handling sensitive tokens and maintaining state across SPA navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode behavior, content scanning paths, container sizing, and extensive theme extensions for colors, typography, fonts, and animations using CSS variables and plugins.",
  "project_state.json": "Structured metadata describing the overall project, including schema/versioning, a high-level summary, and a catalog of existing frontend and backend features for an ICP-based e-commerce storefront."
}